---
kind: other
id: Properties.T:Autodesk.Revit.DB.ExternallyTaggedNonBRep
source: html/59324092-f8c8-89ed-b335-7169317769f8.htm
---
# ExternallyTaggedNonBRep Properties

The external Id of the geometry object.